[
    {
        "id": "jkuat-1",
        "news_banner": "",
        "news_header": "Staff and Students inducted on New E-content Platform",
        "news_cut": "Jomo Kenyatta University of Agriculture and Technology library has inducted staff and students on My Loft, a library application that helps in the organization, tracking and discovering books in your personal collection. The application is designed to make reading experience smooth and ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-2",
        "news_banner": "",
        "news_header": "African Development Bank to Support Establishment of Facilities at PAUSTI",
        "news_cut": "The African Development Bank (AfDB) and the JKUAT-based Pan African University Institute for Basic Science, Technology and Innovation (PAUSTI) have initiated discussions aimed at establishing a collaboration framework that will lead to funding towards the establishment of world-class ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-3",
        "news_banner": "",
        "news_header": "Cultivating Enset, the ‘Golden Plant’ that Could Revolutionize Food Security in Kenya",
        "news_cut": "Jomo Kenyatta University of Agriculture and Technology (JKUAT) has successfully obtained Cultivated Enset, a banana-related plant native to Southern Ethiopia that has immense potential to boost food security in Kenya.   This achievement holds immense significance as Enset, which can grow in ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-4",
        "news_banner": "",
        "news_header": "Strengthening Patient Care and Diagnostic Innovation",
        "news_cut": "As healthcare evolves and new diseases emerge, it is essential for healthcare professionals to improve on their skills in order to address these challenges effectively. This then translates to improved patient care and subsequently better medical treatment outcomes. To this end the Department ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-5",
        "news_banner": "",
        "news_header": "Ethiopian University Explores Collaboration with JKUAT",
        "news_cut": "The Institute of Biotechnology Research (IBR) at Jomo Kenyatta University of Agriculture and Technology (JKUAT) has been identified by Arba Minch University (AMU, Ethiopia) as a potential collaborator in advancing their banana research efforts, given IBR’s distinguished reputation in banana ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-6",
        "news_banner": "",
        "news_header": "JKUAT and PAUSTI Students Demonstrate Research Acumen",
        "news_cut": "Over the years, university researchers have been the vanguards of innovation, offering invaluable solutions to pressing societal problems. JKUAT and PAUSTI post-graduate students recently showcased their fresh and cutting-edge research ideas, driven by the need to address various gaps in the ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-7",
        "news_banner": "",
        "news_header": "Expansion Work on Varsity’s World Class Baseball Facility on Course",
        "news_cut": "The Vice Chancellor, Prof. Victoria Wambui Ngumi, held discussions with Mr. Kevin Schreiber of the ifwebuildit group when he visited the university, Thursday, May 2, 2024. During the Council boardroom meeting, Mr. Schreiber updated the Vice Chancellor on the current expansion of the ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-8",
        "news_banner": "",
        "news_header": "JKUAT Deploys Advanced Air Quality Surveillance Technology to Combat Global Warming",
        "news_cut": "With the spotlight sharply focused on climate change and global warming amid the current destruction of life and property by adverse weather, various stakeholders are making concerted efforts to address the causes. Air pollution, identified as one of the primary contributing factors to adverse ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-9",
        "news_banner": "",
        "news_header": "Youth urged to be active players in Kenya’s coconut sub-sector",
        "news_cut": "The agriculture sector remains the backbone of Kenya’s economy and directly contributes 29% of the annual GDP and another 26% indirectly. However, the participation of youth in the sector is still low yet approximately, 64 % of the unemployed Kenyans are youth. This was a major concern for ...",
        "news_content": "",
        "posting_date": ""
    },
    {
        "id": "jkuat-10",
        "news_banner": "",
        "news_header": "Building Bridges: Role of the Office of the Ombudsman",
        "news_cut": "In every academic community, conflicts and disagreements are inevitable. Whether they arise between students, faculty members, or staff, these challenges can create tension and hinder productivity if left unresolved. Recognizing the importance of fostering a harmonious environment conducive to ...",
        "news_content": "",
        "posting_date": ""
    }
]