[
    {
        "id": "jkuat-1",
        "news_banner": "",
        "news_header": "Staff and Students inducted on New E-content Platform",
        "news_cut": "Jomo Kenyatta University of Agriculture and Technology library has inducted staff and students on My Loft, a library application that helps in the organization, tracking and discovering books in your personal collection. The application is designed to make reading experience smooth and ...",
        "news_content": "Jomo Kenyatta University of Agriculture and Technology library has inducted staff and students on My Loft, a library application that helps in the organization, tracking and discovering books in your personal collection. The application is designed to make reading experience smooth and enjoyable. \n The training workshop held, May 7-8, 2024, at the Assembly Hall, attended by staff and students from the College of Human Resource Development (COHRED). The Principal of COHRED, Prof. Florence Mwaura underscored the significance of the training saying the exercise is important in planning and anticipating the future. \n “As academicians we must endeavor to catch up to artificial intelligence which will have serious implication on how we operate,” said Prof. Mwaura. \n The University Librarian, Dr. Roselyn Mang’ira said that the purpose of the workshop was to equip participants with fresh techniques and new trends in the utilization of the library space. \nShe further noted that the training was expanded to include other areas such as university anti plagiarism policy and other relevant policies, detecting plagiarism using anti-plagiarism software, documentation layout using APA and thesis verification. \n Other areas of focus included citation and reference management tools, publishing on peer reviewed journals and creation and population of ORCID accounts. \n Dr. Mangira expressed her gratitude to Silda Technologies for spearheading the training exercise and as well as assisting in the migration from the outdated platform to MYLOFT . \n Mr Vaibhar Goel from Silda Technologies explained that MYLOFT has been designed to offer easy accessibility to library material since it is a mobile and web-based application.",
        "posting_date": ""
    },
    {
        "id": "jkuat-2",
        "news_banner": "",
        "news_header": "African Development Bank to Support Establishment of Facilities at PAUSTI",
        "news_cut": "The African Development Bank (AfDB) and the JKUAT-based Pan African University Institute for Basic Science, Technology and Innovation (PAUSTI) have initiated discussions aimed at establishing a collaboration framework that will lead to funding towards the establishment of world-class ...",
        "news_content": "The African Development Bank (AfDB) and the JKUAT-based Pan African University Institute for Basic Science, Technology and Innovation (PAUSTI) have initiated discussions aimed at establishing a collaboration framework that will lead to funding towards the establishment of world-class laboratories and hostels facilities at the institute. \n Under the initiative christened, Second Appraisal for PAUSTI, the institute will witness infrastructural expansion in form of establishment of hostels and labs for its postgraduate students. \n The laboratories will boost research capacity of PAUSTI students allowing them to engage in research geared towards providing solutions to African-based challenges. \n Speaking during the meeting attended by representatives from AfDB and PAUSTI, the JKUAT Vice Chancellor, Prof. Victoria Wambui Ngumi appreciated AfDB for its assistance and for choosing to work with PAUSTI by extending financial support for a range of projects. \n “Well-equipped labs will give students practical skills that complement theoretical information learned in the classrooms. The hands-on approach improves learning and retention of knowledge across various fields, including science, engineering, medicine, and technology,” said Prof. Ngumi. \n Prof. Ngumi further noted that research conducted in university labs can lead to the development of new technologies, products and services that drive economic growth and job creation. She added that investing in lab equipment and research infrastructure is important in enabling universities to foster innovation ecosystems and regional development. \n While lauding AfDB for their support, PAUSTI Director, Prof. Turoop Losenge said modern research necessitates a multidisciplinary approach. He further noted that equipped labs not only provide  shared space where researchers from different disciplines can collaborate on projects and exchange ideas, but also allows them to take advantage of complementary expertise and resources. \n “The labs will be essential for conducting research and innovation activities. Constructing state-of-the-art research facilities will enable the students to pursue cutting-edge research projects, develop innovative solutions to complex problems and contribute to advancements in knowledge and technology,” said Prof. Losenge. \n Dr. Keiko Takei, AfDB’s Chief Education Analyst and the project’s Principal Investigator, said the initiative would further cement PAUSTI’s reputation as a center of excellence and continues to produce exceptional graduates for Africa and the international community. \n “Investing in facilities such as labs and hostels is critical to creating a suitable learning environment. These projects not only enhance quality of education but also contribute to general growth of the institution and its students,” observed Dr. Takei. \n The Chief Education Analyst stated that the proposed lab and hostel projects are well aligned with the AfDB’s priorities for education and infrastructure development in Africa, addressing key needs in higher education and supporting the bank’s goal of promoting inclusive and sustainable growth across the continent.",
        "posting_date": ""
    },
    {
        "id": "jkuat-3",
        "news_banner": "",
        "news_header": "Cultivating Enset, the ‘Golden Plant’ that Could Revolutionize Food Security in Kenya",
        "news_cut": "Jomo Kenyatta University of Agriculture and Technology (JKUAT) has successfully obtained Cultivated Enset, a banana-related plant native to Southern Ethiopia that has immense potential to boost food security in Kenya.   This achievement holds immense significance as Enset, which can grow in ...",
        "news_content": "Jomo Kenyatta University of Agriculture and Technology (JKUAT) has successfully obtained Cultivated Enset, a banana-related plant native to Southern Ethiopia that has immense potential to boost food security in Kenya.  \n This achievement holds immense significance as Enset, which can grow in many agro-ecological zones with altitudes ranging between 1500 to 2500 (meaning it can grow in swampy or dry areas) has the potential to provide sustenance for millions, particularly in regions grappling with the challenges of food insecurity worsened by drought conditions. \n This unprecedented feat is courtesy of a project spearheaded by the Institute of Biotechnology Research (IBR) at JKUAT led by researchers Dr. Sylvester Anami and Dr Grace Mungai in collaboration with Arba Minch University (AMU, Ethiopia), Ethiopian Biodiversity Institute (EBI), Girl Child Network (Kenya) and Alabaster International (USA). \n Enset is described as the golden plant due to its numerous benefits. The entire plant which takes two years to mature (under optimal conditions) without the need for foreign fertilizer can be used for various uses such as food (the root, cassava-like product usually referred to as a corm can weigh up to 200 kilos per tree) that can feed a family of 10 for  months. \n The leaves serve multiple purposes, proving to be versatile alternatives in various contexts. They can be used as food wrappers during baking, offering a sustainable substitute for aluminum foil and plastics, which may leach into the food. Moreover, they double as serving plates thus providing eco-friendly alternatives especially in the rural areas. \n Additionally, these leaves can be used as livestock fodder, thereby reducing the competition between humans and animals for food resources, and once they decompose they improve the soil fertility and reduce its erosion. This assures long-term sustainability of food production. \n During a visit to JKUAT, Prof. Behailu Merdekios, the Deputy Vice President of Research and Industrial Linkage at AMU, commended JKUAT for acquiring this extremely valuable plant given that Ethiopia is highly protective of its genetic material. \n He hailed Enset as an excellent nutrition-dense food staple whose cultivation in various regions of Ethiopia, particularly in the South and Southwestern areas, has sustained millions of Ethiopians for centuries, even amidst challenges like drought and other harsh climatic conditions. \n Notably, research conducted in Ethiopia has shown that these Enset-producing regions do not experience malnutrition. “Enset has been a friend of Ethiopia in tough times and is the next superfood because it is gluten-free, fiber and mineral-rich. I am delighted at this milestone for Kenya because food can be a tool for diplomacy and promote Pan-Africanism and by sharing these resources we can bring communities together and ease suffering from hunger,” explained Prof. Merdekios. \n So far, the Enset plant has demonstrated its numerous value-addition options such as flour whose shelf life lasts for three years with no change in color or quality. At the industry level the women in Ethiopia have been able to produce sisal fibers from the pseudostem to make baskets thus nothing from this plant is wasted. \n According to Dr. Anami, although the wild variety grows in many parts of Kenya, and is used for ornamental purposes, its use as food has not been explored. It is expected that after an extensive three-year research at IBR which ends in 2025, the cultivated Enset will be available for planting in different regions in Kenya. \n This research, as explained by Dr. Mungai will also include postgraduate students at IBR who will look into the genomics and domestication of Enset. This is important as the data generated will inform important aspects such as nutrition profile, and the research process will have engaged farmers at the trial stages before availing it to priority regions. \n So far, the planted corms of cultivated Enset at the IBR greenhouse which germinated after three months into hundreds of shoots have been transplanted into pots. This exercise experienced 100 percent survival and establishment of transplanted material. Meanwhile, the dedicated researchers, who include Dr. Mercy Kidaha an expert in Plant Biotechnology and Horticulture, are diligently crafting a tissue culture protocol to further enhance their cultivation and utilization efforts.",
        "posting_date": ""
    },
    {
        "id": "jkuat-4",
        "news_banner": "",
        "news_header": "Strengthening Patient Care and Diagnostic Innovation",
        "news_cut": "As healthcare evolves and new diseases emerge, it is essential for healthcare professionals to improve on their skills in order to address these challenges effectively. This then translates to improved patient care and subsequently better medical treatment outcomes. To this end the Department ...",
        "news_content": "As healthcare evolves and new diseases emerge, it is essential for healthcare professionals to improve on their skills in order to address these challenges effectively. This then translates to improved patient care and subsequently better medical treatment outcomes. \n To this end the Department of Medical Lab Science (MLS) at Jomo Kenyatta University of Agriculture and Technology (JKUAT) organized a five-day training on advanced histotechnology, cytotechnology and clinical chemistry techniques for diagnostic research and innovation from April 22nd to 26th at the main campus. \n The aim of the training was to provide hands on skills for health professionals and students undertaking related courses. One of the key topics was tissue processing which is essential for working with biological samples such as those taken during a biopsy for examination or experiments. \n Understanding the principles behind each tissue processing technique enables the lab technicians or researchers to recognize and troubleshoot potential issues that may arise during this processing which could affect the quality of the final tissue sections, and therefore give erroneous results. \n Another important topic was Cytology techniques which are used in the collection and examination of fluid specimens under a microscope. The techniques including Fine Needle Aspiration (FNA) and Cervical smear are vital in the diagnosis of various conditions including infections, inflammation, and cancers. \n Others such as the Buccal smear technique which utilizes cells from the lining cheek is used for DNA testing which can provide insights on an individual’s predisposition to certain diseases, and how one is likely to respond to certain drugs. It is also used in paternity tests and even identifying criminals during a forensic investigation. \n According to Ms. Millicent Ogutu an expert on Medical Microbiology and Parasitology at MLS, while acquiring technical proficiency is pivotal, it must be coupled with a profound grasp of quality control principles. This synergy ensures the delivery of precise, timely, and comprehensive reports from the histology laboratory. \n “Patients can only trust your facility if there is quality control. Your results should be reproducible in other labs and this can only be achieved by adhering to the processes you have learnt. This helps you identify and correct errors leading to reduced turnaround time and therefore cost-effective treatment,” explained Ms. Ogutu \n During the training’s closing ceremony, the participants from different institutions including Moi Voi Referral Hospital, Nairobi Polytechnic and Pan African University Institute for Basic Sciences Technology and Innovation (PAUSTI) expressed their gratitude for the program. They emphasized how the networking opportunities provided during the training had significantly enriched their social capital within the scientific community. \n The postgraduate students noted that applying what they learned in theory to hands-on practice helped solidify their understanding and prepared them for their research projects. Meanwhile, for the practicing professionals, acquiring new skills in Histopathology equipped them with the background knowledge necessary to effectively operate automated processes in their daily work. \n Dr. Amos Mbugua, Chairman of MLS, emphasized the department’s commitment to offer practical courses tailored to align with contemporary global paradigms like the One Health Approach. These encompass cutting-edge subjects such as artificial intelligence in healthcare, Anti-Microbial Resistance (AMR), Bioinformatics, and more. \n The next training on other advanced techniques in the Medical Lab Sciences will be offered in September 2024.",
        "posting_date": ""
    },
    {
        "id": "jkuat-5",
        "news_banner": "",
        "news_header": "Ethiopian University Explores Collaboration with JKUAT",
        "news_cut": "The Institute of Biotechnology Research (IBR) at Jomo Kenyatta University of Agriculture and Technology (JKUAT) has been identified by Arba Minch University (AMU, Ethiopia) as a potential collaborator in advancing their banana research efforts, given IBR’s distinguished reputation in banana ...",
        "news_content": "The Institute of Biotechnology Research (IBR) at Jomo Kenyatta University of Agriculture and Technology (JKUAT) has been identified by Arba Minch University (AMU, Ethiopia) as a potential collaborator in advancing their banana research efforts, given IBR’s distinguished reputation in banana tissue culture. \n This was part of the discussion during a courtesy call paid by AMU’s Deputy Vice President for Research and Industrial Linkage Prof. Behailu Merdekios on his counterpart Prof. Jackson Kwanza the Deputy Vice Chancellor Research, Production and Extension (RPE) on April 25, 2024. \n Prof. Behailu was also visiting IBR for an ongoing donor-funded project on Enset where AMU is partnering with JKUAT, Ethiopian Biodiversity Institute (EBI) and Alabaster International (USA). \n Enset is a multipurpose and climate-resilient plant related to the banana that can grow in any agroecological zone (whether swampy or dry or in-between) and is beneficial to humans, animals and the industry due to its numerous uses. \n Prof. Kwanza welcomed the initiative to collaborate with AMU and commended the existing partnership on the Enset project which commenced in November 2023 with the premise of boosting food security in Kenya. The project is led by IBR’s Principal Investigators Dr. Sylvester Anami and Dr. Grace Mungai. \n “JKUAT values collaborations which are facilitated by the Directorate of Linkages. This investment in research has resulted in high webometric ranking placing JKUAT second nationally,” said Prof. Kwanza. \n Prof. Behailu expressed the desire for AMU to collaborate with JKUAT on different disciplines aside from Biotechnology, noting that the two institutions were very similar in terms of student numbers and administrative collegiate set-up. \n He further explained that AMU was keen on establishing a Banana Research Institute inspired by the success of the IBR and this proposed symbiotic collaboration on banana research would greatly benefit the two institutions which are established pioneer researchers for either plant. \n The establishment of the Banana Research Institute at AMU would complement the Enset project by supplementing the potassium deficiency inherent in Enset, as banana powder is a potent source of this essential nutrient. \n Prof. Kwanza also underscored the importance of extending the project’s reach to the community to maximize its impact, aligning with the current trend in research and its dissemination through publications. \n This emphasis echoed sentiments expressed earlier by Prof. Behailu during his presentation at the IBR Bioinformatics Laboratory, where postgraduate students engaged in discussions on Enset and related topics. \n Prof. Behailu stressed that publications should not be viewed as the final outcome but rather as a means to further the application of research within the community. \n The fruitful meeting was also attended by Prof. Justus Onguso Director IBR and Dr. Patrick Mbindyo Registrar RPE.",
        "posting_date": ""
    },
    {
        "id": "jkuat-6",
        "news_banner": "",
        "news_header": "JKUAT and PAUSTI Students Demonstrate Research Acumen",
        "news_cut": "Over the years, university researchers have been the vanguards of innovation, offering invaluable solutions to pressing societal problems. JKUAT and PAUSTI post-graduate students recently showcased their fresh and cutting-edge research ideas, driven by the need to address various gaps in the ...",
        "news_content": "Over the years, university researchers have been the vanguards of innovation, offering invaluable solutions to pressing societal problems. JKUAT and PAUSTI post-graduate students recently showcased their fresh and cutting-edge research ideas, driven by the need to address various gaps in the economy. \n In a vibrant display of research presentations under the  AFRICA-ai-JAPAN Project on Friday, May 3, 2024, presentations covered a wide range of thematic areas, highlighting the depth and diversity of research being conducted at twin institutions. From agricultural innovations to biotechnology solutions, each researcher showcased unique contribution in their respective fields. \n One notable presentation came from Oumarou Soro, whose research focused on anti-microbial resistance, a pressing global health concern, which according to WHO, leads to approximately 700,000 deaths yearly, with projections indicating a staggering 10 million deaths annually and a cost of US$100 trillion by 2050. \n Oumarou revealed that he focuses on Enterococcus faecalis, a drug-resistant bacterium identified by WHO as a priority pathogen, which commonly causes infections in healthcare settings. His study focuses on isolating and characterizing viruses capable of combating multidrug-resistant E. faecalis and effectively breaking down their protective biofilms, offering a potential solution to this growing public health threat. \n Professor Hiroshi Koaze, AFRICA-ai-JAPAN Project Lead, expressed satisfaction with the quality of presentations, noting a marked improvement from the previous sessions. \n “It’s inspiring to witness the dedication and progress demonstrated by our researchers. Their commitment to advancing knowledge and addressing real-world challenges is commendable,” remarked Prof. Koaze. \n Looking ahead, Prof. Koaze reaffirmed the project’s commitment to supporting researchers and fostering a culture of academic excellence. \n “Our journey doesn’t end here. We will continue to provide platforms for collaboration and innovation, empowering researchers to make meaningful contributions to society,” said Prof. Koaze. \n The poster presentations were evaluated by a panel of judges comprising experts from various sub-task forces within the AFRICA-ai-JAPAN project. Their rigorous assessment ensured that only the most promising research projects received recognition. \n In line with tradition, all participants will receive certificates of participation. Additionally, the top three presenters will be honored with tokens of appreciation in a ceremony presided over by the Vice Chancellor.",
        "posting_date": ""
    },
    {
        "id": "jkuat-7",
        "news_banner": "",
        "news_header": "Expansion Work on Varsity’s World Class Baseball Facility on Course",
        "news_cut": "The Vice Chancellor, Prof. Victoria Wambui Ngumi, held discussions with Mr. Kevin Schreiber of the ifwebuildit group when he visited the university, Thursday, May 2, 2024. During the Council boardroom meeting, Mr. Schreiber updated the Vice Chancellor on the current expansion of the ...",
        "news_content": "The Vice Chancellor, Prof. Victoria Wambui Ngumi, held discussions with Mr. Kevin Schreiber of the ifwebuildit group when he visited the university, Thursday, May 2, 2024. \n During the Council boardroom meeting, Mr. Schreiber updated the Vice Chancellor on the current expansion of the university’s state-of-the-art baseball grounds, which will include two fields for adult baseball and another one for hybrid softball and youth baseball capable of hosting local and international games. \n According to Schreiber, the facility, which will have a capacity of 500 people and training facilities for athletes and coaches, will also provide skills and leadership training, as well as enhance young people’s access to sports, health, and education. \n With the initial proof of concept phase that began in September 2021, the fields are being developed carefully, cost-effectively with input from JKUAT architects includes water conservation and green design concepts. \n While giving her contribution at the meeting, Prof. Ngumi emphasized the initiative’s relevance to JKUAT particularly to the student community, reiterating that the university is eager to offer the required support to guarantee the project’s successful completion so that the university as well as the Juja community benefit. \n “We have always been keen to provide our students with globally acceptable facilities, and we feel this project could be a significant chance to fulfill our purpose of upskilling and preparing them for the international stage,” said Prof. Ngumi. \n The Vice Chancellor stated that the project, which is a faculty- and student-led design effort, will give architecture and landscape architecture department students the necessary practical learning. \n Prof. Ngumi underscored the importance of fostering global collaboration in infrastructure development and upskilling university staff and students, adding that partnerships are critical in offering a multidisciplinary approach to successfully tackling challenges facing higher education institutions. \n According to Mr. Schreiber, when the project is completed, the university will be the first institution in East Africa to have baseball and softball fields, as well as the first multi-field complex in Sub-Saharan Africa outside of South Africa. \n “As ifwebuildit, we believe in the potential of collaboration to build sports infrastructure that will give a strong foundation for young people to develop their abilities and improve their lives,” said Mr. Schreiber. \n He stated that the complex will be a hub of excellence in sports, leadership, and infrastructure development, noting, “The project will ‘help expand the game and provide spaces where aspirations will be realized.” \n Mr. Schreiber said as part of their plans to fund the remainder of the project, they will hold a series of friendly games on May 18, this year in preparation for the big event on July 6, which will commemorate 60 years of Kenya-US partnership and will feature high-profile guests. \n Ifwebuildit is the principal organization working on the project that emerged from the collaboration between JKUAT and the Nairobi Buffaloes Club baseball team.",
        "posting_date": ""
    },
    {
        "id": "jkuat-8",
        "news_banner": "",
        "news_header": "JKUAT Deploys Advanced Air Quality Surveillance Technology to Combat Global Warming",
        "news_cut": "With the spotlight sharply focused on climate change and global warming amid the current destruction of life and property by adverse weather, various stakeholders are making concerted efforts to address the causes. Air pollution, identified as one of the primary contributing factors to adverse ...",
        "news_content": "With the spotlight sharply focused on climate change and global warming amid the current destruction of life and property by adverse weather, various stakeholders are making concerted efforts to address the causes. \n Air pollution, identified as one of the primary contributing factors to adverse weather, also negatively impacts human, animal, and plant health. \n As a leading research institution in the region, Jomo Kenyatta University of Agriculture and Technology (JKUAT) has answered the call to provide research solutions for mitigating the effects of global warming. \n In a landmark collaboration aimed at revolutionizing air quality monitoring, JKUAT in partnership with Air Quality Systems (AQS) East Africa, Nairobi City Council and the regulatory body National Environment Management Authority (NEMA), recently deployed passive air samplers to monitor air quality. \n The partnering researchers showcased the practical applications and advantages of passive samplers, while also highlighting the cost-effectiveness and reliability of the passive air samplers. The passive air samplers use diffusion as the main data collection mechanism hence not requiring power or internet to collect the samples. \n A comparative study of passive samplers (diffusion tubes) and low-medium cost samplers, the focal point of the activity, offers a game-changing approach to air quality monitoring. Their simplicity and portability make them an attractive alternative to conventional active samplers. By passively collecting air pollutants over time, they provide valuable data insights without the need for continuous power or complex equipment. \n During the installation exercise, the Air quality systems East Africa team demonstrated the deployment of passive samplers. This, the researchers revealed, will allow for a comprehensive assessment of performance of the passive samplers in capturing pollutants such as particulate matter (PM), nitrogen dioxide (NO2), sulfur dioxide (SO2), and volatile organic compounds (VOCs). \n The study will, over time reveal how, combining the strengths of both passive and active air sampling technologies, researchers will be able to gain a more holistic understanding of air quality dynamics, enabling informed decision-making and policy formulation. \n During a research brainstorming session at the University, Tuesday, April 30, 2024, JKUAT’s Director of Institute of Energy and Environment Technology (IEET), Prof. Joseph Kamau underscored the significance of the research partnership in pooling resources to combat climate change. \n In efforts to enhance capacity in the field, Prof. Kamau suggested that IEET and partners can jointly tailor air quality certification program. \n JKUAT’s lead researcher in Air Quality, Dr. Paul Njogu, expressed pride in the innovative approach taken by his team and partners in exploring new technologies for environmental monitoring. He stated that the initiative reflected the institution’s dedication to addressing pressing environmental management challenges. \n The presence of NEMA representatives underscored the importance of regulatory oversight in environmental monitoring initiatives. By collaborating with regulatory agencies, academic institutions, and industry partners are driving innovation and setting new standards for air quality management. \n County Director of NEMA, Jilani Chigulu, said, the collaborative effort not only showcases the commitment of partners to advancing environmental research but also reinforces their commitment to positive impact on society. \n Jilani further noted that it was encouraging to see how the adoption of innovative, cost effective and easily deployable solutions demonstrated the potential of the technology. He emphasized on more of such partnerships to generate data that could be used in legislation and better decision-making on-air pollution matters by the regulator. \n Jilani pledged NEMA’s support for the collaborative research, saying the program is mutually beneficial to all partners and the country at large. \n AQS Business Development Manager, Anthony, appreciated all stakeholders for availing themselves and for all their efforts in making the activity a success. \n “I am grateful for all the partners for heeding the calls for a collaboration. It is part of our responsibility to identify and expand our collaboration to include emerging issues,” said Anthony. \n The comparative study marks a significant milestone for IEET in advancing air quality monitoring techniques. With passive and active samplers working hand in hand, data accuracy, efficiency, and sustainability are ensured in safeguarding the environment and public health.",
        "posting_date": ""
    },
    {
        "id": "jkuat-9",
        "news_banner": "",
        "news_header": "Youth urged to be active players in Kenya’s coconut sub-sector",
        "news_cut": "The agriculture sector remains the backbone of Kenya’s economy and directly contributes 29% of the annual GDP and another 26% indirectly. However, the participation of youth in the sector is still low yet approximately, 64 % of the unemployed Kenyans are youth. This was a major concern for ...",
        "news_content": "The agriculture sector remains the backbone of Kenya’s economy and directly contributes 29% of the annual GDP and another 26% indirectly. However, the participation of youth in the sector is still low yet approximately, 64 % of the unemployed Kenyans are youth. \n This was a major concern for stakeholders at the National Coconut Week and Consultative Conference in Kilifi County, which opened on April 18 – 19, followed by county chapters running from April 20 – 26, 2024. \n During a panel session to interrogate “Youth involvement in an innovative coconut value chain,” lead panelist, Mr. Mwalimu Menza, Senior Research Scientist, Industrial Crops Institute at KALRO, Mtwapa, JKUAT Deputy Vice Chancellor in charge of Administration and Finance, Prof. Bernard Ikua and Mr. James Kapombe, CEO of Cocogrow Company, explored challenges to youth’s participation in the coconut value chain. \n “Limited access to agricultural land, inadequate knowledge, skills and information, negative attitude, long maturity duration for local coconut variety” Mr. Menza noted, continue to work as a disincentive to young people’s active participation in the coconut sub sector. \n The Research Chair project spearheaded by the Jomo Kenyatta University of Agriculture and Technology (JKUAT) was one of the participating institutions at the conference panel discussion. Addressing the involvement of youth in research especially in the coconut sub sector, Prof. Muturi who is “investigating the impact of strategic interventions on the competitiveness of the coconut value addition enterprise” under the Research Chair project said, “Experts are working with farmers, women and youth owned SMEs in identifying challenges and providing solutions to adding value to the coconut.” \n With support from Canadian International Development Research Centre through the National Commission for Science, Technology and Innovation (NACOSTI), Prof. Muturi highlighted the mechanization efforts championed by JKUAT in developing various technologies and equipment for use by youth and women groups in the coconut value chain. \n Citing manual dehuskers, a mixing machine for processing beauty and cosmetics products and briquetting machines as some of the technologies disseminated by JKUAT, Prof. Muturi said, “one of the major drawbacks in rolling out research work in the coconut value chain is lack of funds for extension.” \n Panel discussants therefore called for key stakeholders “to provide financial support towards research endeavours including the dissemination of technologies that could help to revitalize the coconut sub sector.” \n Speaking on the sidelines of the conference, Prof. Bernard Ikua, further pointed out other ongoing projects such, as “development of cosmetic and beauty products from coconut oil, performance of coconut fiber reinforced clay based geopolymer concrete, development of coconut fiber biochar and its application as soil amendment, evaluation of coconut oil for improved product quality and consumer health in Kenya.” \n A multi- disciplinary team of researchers from JKUAT, Moi and Multimedia universities and the Nuts and Oil Crops Directorate, is currently implementing Research Chair project activities on technological innovations and productivity and quality in the coconut value chain “to enhance Kenya’s competitiveness in the manufacturing of value added nut products particularly the coconut products,” Prof. Ikua stated. \n The conference participants identified opportunities that could attract youth in the coconut value chain including, “coconut nursery agribusiness, value addition with over 100 products identified, early maturing hybrid coconut production, intercropping with short duration high value crops.” \n The panel called upon youth to offer services at a fee using equipment such as climbing machines for coconut harvesting, dehusking machines among others.",
        "posting_date": ""
    },
    {
        "id": "jkuat-10",
        "news_banner": "",
        "news_header": "Building Bridges: Role of the Office of the Ombudsman",
        "news_cut": "In every academic community, conflicts and disagreements are inevitable. Whether they arise between students, faculty members, or staff, these challenges can create tension and hinder productivity if left unresolved. Recognizing the importance of fostering a harmonious environment conducive to ...",
        "news_content": "In every academic community, conflicts and disagreements are inevitable. Whether they arise between students, faculty members, or staff, these challenges can create tension and hinder productivity if left unresolved.\n Recognizing the importance of fostering a harmonious environment conducive to learning and collaboration, Jomo Kenyatta University of Agriculture and Technology (JKUAT) established the Office of the Ombudsman.\n The Office of the Ombudsman serves as a neutral and confidential resource for members of the JKUAT community seeking assistance in resolving conflicts and addressing grievances. Led by experienced professionals committed to principles of impartiality and fairness, the Ombudsman’s office, provides a safe space for open dialogue and constructive problem-solving.\n Bishop Silas Yego, the University Ombudsman, emphasizes the significance of confidentiality and impartiality in conflict resolution.\n “Our primary goal is to create an environment where individuals feel comfortable expressing their concerns without fear of judgment,” says Bishop Yego. \n One of the key principles guiding the Office of the Ombudsman is confidentiality. Individuals who seek assistance can rest assured that their privacy will be respected throughout the resolution process. This confidentiality encourages open communication and enables parties to express themselves freely without fear of reprisal.\n Bishop Yego further underscores the importance of impartiality in the resolution process. “As an Ombudsman, my role is not to take sides but rather, to facilitate fair resolution that meets the needs of all parties involved,” he explains. “By maintaining neutrality, we can build trust and work towards sustainable solutions.”\n The Office of the Ombudsman offers a variety of informal resolution mechanisms, including mediation, facilitation, and conflict coaching. These approaches empower individuals to address conflicts collaboratively, explore creative solutions, and restore relationships that may have been strained by misunderstanding or disagreement.\n “I am currently in my last term as the University Ombudsman. One of our achievements for the last three years is that we have been able to resolve all our conflicts without having to go to court,” reveals Bishop Yego.\n Moreover, the Ombudsman provides guidance and support to individuals navigating complex academic, interpersonal, or administrative challenges. Whether it’s a student facing academic probation, a faculty member experiencing conflicts within a research team, or a staff member encountering difficulties with a supervisor, the Ombudsman is there to offer practical assistance.\n The impact of the Office of the Ombudsman extends beyond individual conflicts. By promoting a culture of accountability, the Ombudsman contributes to a positive and inclusive campus climate where all members of the JKUAT community feel valued and supported.\n\n Reflecting on the broader mission of the Ombudsman’s office, Bishop Yego expresses his commitment to promoting harmony and understanding within the JKUAT community.\n “Our goal is not just to resolve conflicts but to foster a culture of respect and collaboration. By working together, we can create a campus environment where everyone can thrive.”\n Bishop Yego believes, his job is a calling, revealing his passion to serve people. Away from the university, Bishop Yego, who hails from Kitale, has revealed that he has a foundation to help less fortunate children.\n The office of the Ombudsman is located in Technology House Fourth floor at JKUAT Main Campus.",
        "posting_date": ""
    }
]